'use strict'

alert(`Для визначення середнього арифметичного значення,\nвведіть будь ласка три чисельники.`)

const a = +prompt('Введіть перше значення:')
    if (isNaN(a)){
        alert(`Ви ввели некоректне значення!\nВведіть будь ласка числове значення.`)
        const a = +prompt('Введіть перше значення:')
    }

const b = +prompt('Введіть друге значення:')
    if (isNaN(b)){
        alert(`Ви ввели некоректне значення!\nВведіть будь ласка числове значення.`)
        const b = +prompt('Введіть перше значення:')
    }

const c = +prompt('Введіть третє значення:')
    if (isNaN(c)){
        alert(`Ви ввели некоректне значення!\nВведіть будь ласка числове значення.`)
        const c = +prompt('Введіть перше значення:')
    }

const d = (a + b + c)/3;
    console.log(d);

alert(`Середнє арифметичне значення чисел дорівнює ${d}`);